espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/src/em_lcd.c
#if defined(_SILICON_LABS_32B_SERIES_2)
  uint32_t bacfg = LCD->BACFG;

  /* Reconfigure the frame count configuration. */
  bacfg &= ~(_LCD_BACFG_FCTOP_MASK
             | _LCD_BACFG_FCPRESC_MASK);
  bacfg |= (fcInit->top << _LCD_BACFG_FCTOP_SHIFT);
  bacfg |= fcInit->prescale;

  /* Set the Blink and Animation Control Register. */
  LCD_Enable(false);  /* Ensure LCD disabled before writing WSTATIC fields. */
  LCD_ReadyWait();
  LCD->BACFG = bacfg;
  LCD_Enable(true);
#else
  uint32_t bactrl = LCD->BACTRL;

  /* Reconfigure the frame count configuration. */
  bactrl &= ~(_LCD_BACTRL_FCTOP_MASK
              | _LCD_BACTRL_FCPRESC_MASK);
  bactrl |= (fcInit->top << _LCD_BACTRL_FCTOP_SHIFT);
  bactrl |= fcInit->prescale;

  /* Set the Blink and Animation Control Register. */
  LCD->BACTRL = bactrl;
#endif

  LCD_FrameCountEnable(fcInit->enable);
}

/***************************************************************************//**
 * @brief
 *   Configure the LCD controller Animation feature.
 *
 * @param[in] animInit
 *   A pointer to the LCD Animation initialization structure.
 ******************************************************************************/
void LCD_AnimInit(const LCD_AnimInit_TypeDef *animInit)
{
  uint32_t bactrl = LCD->BACTRL;

  EFM_ASSERT(animInit != (void *) 0);

  /* Set initial Animation Register Values. */
  LCD->AREGA = animInit->AReg;
  LCD->AREGB = animInit->BReg;

  /* Configure the Animation Shift and Logic. */
  bactrl &= ~(_LCD_BACTRL_AREGASC_MASK
              | _LCD_BACTRL_AREGBSC_MASK
              | _LCD_BACTRL_ALOGSEL_MASK
#if defined(_LCD_BACTRL_ALOC_MASK)
              | _LCD_BACTRL_ALOC_MASK
#endif
              );

  bactrl |= (animInit->AShift << _LCD_BACTRL_AREGASC_SHIFT);
  bactrl |= (animInit->BShift << _LCD_BACTRL_AREGBSC_SHIFT);
  bactrl |= animInit->animLogic;
#if defined(_LCD_BACTRL_ALOC_MASK)
  bactrl |= animInit->startSeg;
#endif

  /* Reconfigure. */
  LCD->BACTRL = bactrl;

  /* Enable. */
  LCD_AnimEnable(animInit->enable);
}

#if defined(_SILICON_LABS_32B_SERIES_0)
/***************************************************************************//**
 * @brief
 *   Enables updating this range of LCD segment lines.
 *
 * @param[in] segmentRange
 *   A range of 4 LCD segment lines to enable or disable for all enabled COM
 *   lines.
 *
 * @param[in] enable
 *   Boolean true to enable segment updates, false to disable updates.
 ******************************************************************************/
void LCD_SegmentRangeEnable(LCD_SegmentRange_TypeDef segmentRange, bool enable)
{
  if (enable) {
    LCD->SEGEN |= segmentRange;
  } else {
    LCD->SEGEN &= ~((uint32_t)segmentRange);
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Enables a given LCD segment line.
 *
 * @param[in] seg_nbr
 *   Segment line number.
 *
 * @param[in] enable
 *   Boolean true to enable a segment, false to disable.
 ******************************************************************************/
void LCD_SegmentEnable(uint32_t seg_nbr, bool enable)
{
  /* Series 2 supports up to 20 segment lines. */
  EFM_ASSERT(seg_nbr < 20);

  if (enable) {
    GPIO->LCDSEG_SET = 1 << seg_nbr;
  } else {
    GPIO->LCDSEG_CLR = 1 << seg_nbr;
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Enables a given LCD COM line.
 *
 * @param[in] com
 *   COM line number.
 *
 * @param[in] enable
 *   Boolean true to enable a COM , false to disable.
 ******************************************************************************/
void LCD_ComEnable(uint8_t com, bool enable)
{
  /* Series 2 supports up to 4 COM lines. */
  EFM_ASSERT(com < LCD_COM_LINES_MAX);

  if (enable) {
    GPIO->LCDCOM_SET = 1 << com;
  } else {
    GPIO->LCDCOM_CLR = 1 << com;
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Set a given DMA mode operation.
 *
 * @param[in] mode
 *   DMA mode.
 ******************************************************************************/
void LCD_DmaModeSet(LCD_DmaMode_Typedef mode)
{
  LCD->BIASCTRL_CLR = _LCD_BIASCTRL_DMAMODE_MASK;
  LCD->BIASCTRL |= mode;
}
#endif

/***************************************************************************//**
 * @brief
 *   Turn on or clear a segment.
 *
 * @note
 *    For the Gecko Family, the maximum configuration is (COM-lines x Segment-Lines) 4x40.
 *    For the Tiny Gecko Family, the maximum configuration is 8x20 or 4x24.
 *    For the Giant Gecko Family, the maximum configuration is 8x36 or 4x40.
 *
 * @param[in] com
 *   A COM line to change.
 *
 * @param[in] bit
 *   A bit index indicating which field to change.
 *
 * @param[in] enable
 *   True will set segment, false will clear segment.
 ******************************************************************************/
void LCD_SegmentSet(int com, int bit, bool enable)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  /* Series 2 supports up to 4 COM lines. */
  EFM_ASSERT(com < LCD_COM_LINES_MAX);

  /* Series 2 supports up to 20 segment lines. */
  EFM_ASSERT(bit < LCD_SEGMENT_LINES_MAX);

  /* Use a bitband access for atomic bit set/clear of the segment. */
  switch (com) {
    case 0:
      BUS_RegBitWrite(&(LCD->SEGD0), bit, enable);
      break;

    case 1:
      BUS_RegBitWrite(&(LCD->SEGD1), bit, enable);
      break;

    case 2:
      BUS_RegBitWrite(&(LCD->SEGD2), bit, enable);
      break;

    case 3:
      BUS_RegBitWrite(&(LCD->SEGD3), bit, enable);
      break;

    default:
      EFM_ASSERT(0);
      break;
  }
#else
#if defined(_LCD_SEGD7L_MASK)
  /* Tiny Gecko and Giant Gecko Families support up to 8 COM lines. */
  EFM_ASSERT(com < 8);
#else
  /* Gecko Family supports up to 4 COM lines. */
  EFM_ASSERT(com < 4);
#endif

#if defined(_LCD_SEGD0H_MASK)
  EFM_ASSERT(bit < 40);
#else
  /* Tiny Gecko Family supports only "low" segment registers. */
  EFM_ASSERT(bit < 32);
#endif

