espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/src/em_lcd.c
#if defined(_SILICON_LABS_32B_SERIES_2)
  LCD_Enable(true);
#endif
}

#if defined(_SILICON_LABS_32B_SERIES_0)
/***************************************************************************//**
 * @brief
 *   Configure voltage booster
 *
 * The resulting voltage level is described in each part number's data sheet
 *
 * @param[in] vboost
 *   Voltage boost level
 ******************************************************************************/
void LCD_VBoostSet(LCD_VBoostLevel_TypeDef vboost)
{
  /* Reconfigure Voltage Boost */
  LCD->DISPCTRL = (LCD->DISPCTRL & ~_LCD_DISPCTRL_VBLEV_MASK) | vboost;
}
#endif

#if defined(LCD_CTRL_DSC)
/***************************************************************************//**
 * @brief
 *   Configure the bias level for a specific segment line for Direct Segment Control.
 *
 * @note
 *   When DSC is active, each configuration takes up 4 bits in the corresponding
 *   Segment Registers (SEGD0L/SEGD1H for Series 0 and 1, SEGDx for Series 2)
 *   which defines the bias level.
 *   For optimal use of this feature, the entire SEGD-registers should be set
 *   at once in an optimized routine. Therefore, this function shows how to
 *   correctly configure the bias levels and should be used with care.
 *
 * @param[in] segmentLine
 *   A segment line number.
 *
 * @param[in] biasLevel
 *   The bias configuration level. This value must be within the constraints
 *   defined by the LCD_DISPCTRL bias settings. For more information, see the
 *   applicable Reference Manual and data sheet.
 ******************************************************************************/
void LCD_BiasSegmentSet(int segmentLine, int biasLevel)
{
  volatile uint32_t *segmentRegister;
  int               biasRegister;
  int               bitShift;

#if defined(_SILICON_LABS_32B_SERIES_2)
  if (segmentLine >= (int)LCD_SEG_NUM) {
    return;
  }

  /*
   * On Series 2, the following layout is used to configure bias when DSC
   * is active:
   *
   * REGISTERS | ... | 7 .. 4 | 3 .. 0 |
   *   SEGD0   | ... |  seg4  |  seg0  |
   *   SEGD1   | ... |  seg5  |  seg1  |
   *   .....
   */
  biasRegister = segmentLine % 4;
  bitShift     = (segmentLine / 4) * 4;

  switch (biasRegister) {
    case 0:
      segmentRegister = &LCD->SEGD0;
      break;
    case 1:
      segmentRegister = &LCD->SEGD1;
      break;
    case 2:
      segmentRegister = &LCD->SEGD2;
      break;
    case 3:
      segmentRegister = &LCD->SEGD3;
      break;
    default:
      segmentRegister = NULL;
      EFM_ASSERT(0);
      break;
  }

#else

#if !defined(_LCD_SEGD0H_MASK)
  EFM_ASSERT(segmentLine < 20);

  /* A bias configuration for 8 segment lines per SEGDnL register. */
  biasRegister = segmentLine / 8;
  bitShift     = (segmentLine % 8) * 4;

  switch (biasRegister) {
    case 0:
      segmentRegister = &LCD->SEGD0L;
      break;
    case 1:
      segmentRegister = &LCD->SEGD1L;
      break;
    case 2:
      segmentRegister = &LCD->SEGD2L;
      break;
    case 3:
      segmentRegister = &LCD->SEGD3L;
      break;
    default:
      segmentRegister = (uint32_t *)0x00000000;
      EFM_ASSERT(0);
      break;
  }
#else
  EFM_ASSERT(segmentLine < 40);

  /* A bias configuration for 10 segment lines per SEGDn L+H registers. */
  biasRegister = segmentLine / 10;
  bitShift     = (segmentLine % 10) * 4;

  switch (biasRegister) {
    case 0:
      if (bitShift < 32) {
        segmentRegister = &LCD->SEGD0L;
      } else {
        segmentRegister = &LCD->SEGD0H;
        bitShift       -= 32;
      }
      break;
    case 1:
      if (bitShift < 32) {
        segmentRegister = &LCD->SEGD1L;
      } else {
        segmentRegister = &LCD->SEGD1H;
        bitShift       -= 32;
      }
      break;
    case 2:
      if (bitShift < 32) {
        segmentRegister = &LCD->SEGD2L;
      } else {
        segmentRegister = &LCD->SEGD1H;
        bitShift       -= 32;
      }
      break;
    case 3:
      if (bitShift < 32) {
        segmentRegister = &LCD->SEGD3L;
      } else {
        segmentRegister = &LCD->SEGD3H;
        bitShift       -= 32;
      }
      break;
    default:
      segmentRegister = (uint32_t *)0x00000000;
      EFM_ASSERT(0);
      break;
  }
#endif

#endif

  /* Configure a new bias setting. */
  BUS_RegMaskedWrite(segmentRegister, 0xF << bitShift, biasLevel << bitShift);
}
#endif

#if defined(LCD_CTRL_DSC)
/***************************************************************************//**
 * @brief
 *   Configure the bias level for a specific segment line.
 *
 * @note
 *   When DSC is active, each configuration takes up 4 bits in the corresponding
 *   Segment Registers (SEGD4L/SEGD4H for Series 0 and 1, AREGA/AREGB for
 *   Series 2) which defines bias level.
 *   For optimal use of this feature, the entire register set should be set
 *   at once in a optimized routine. Therefore, this function shows how to
 *   correctly configure the bias levels and should be used with care.
 *
 * @param[in] comLine
 *   A COM line number, between 0 and 7 for Series 0 and 1. For Series 2, max
 *   is LCD_COM_NUM, defined in device-specific headers.
 *
 *
 * @param[in] biasLevel
 *   The bias configuration level. This value must be within the constraints
 *   defined by the LCD_DISPCTRL bias settings.
 *   For more information, see the appropriate Reference Manual and data sheet.
 ******************************************************************************/
void LCD_BiasComSet(int comLine, int biasLevel)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  volatile uint32_t *comRegister;
  uint32_t biasRegister;
  uint32_t bitShift;

  if (comLine >= (int)LCD_COM_NUM) {
    return;
  }

  biasRegister = (uint32_t) comLine % 2;
  bitShift     = (comLine / 2) * 4;

  switch (biasRegister) {
    case 0:
      comRegister = &LCD->AREGA;
      break;
    case 1:
      comRegister = &LCD->AREGB;
      break;
    default:
      comRegister = NULL;
      EFM_ASSERT(0);
      break;
  }

  BUS_RegMaskedWrite(comRegister, 0xF << bitShift, biasLevel << bitShift);

#else
  int bitShift;
  EFM_ASSERT(comLine < 8);

